[{"a":"It was the best sandcastle he had ever seen.","b":"C'était le meilleur château de sable qu'il ait jamais vu."},{"a":"Red is greener than purple, for sure.","b":"Le rouge est plus vert que le violet, c’est sûr."},{"a":"Buried deep in the snow, he hoped his batteries were fresh in his avalanche beacon.","b":"Enfoui profondément dans la neige, il espérait que ses batteries étaient neuves dans sa balise d'avalanche."},{"a":"The thick foliage and intertwined vines made the hike nearly impossible.","b":"Le feuillage épais et les vignes entrelacées rendaient la randonnée presque impossible."},{"a":"Little Red Riding Hood decided to wear orange today.","b":"Le Petit Chaperon Rouge a décidé de porter du orange aujourd'hui."},{"a":"Mothers spend months of their lives waiting on their children.","b":"Les mères passent des mois de leur vie à attendre leurs enfants."},{"a":"She was only made the society president because she can whistle with her toes.","b":"Elle n’a été nommée présidente de la société que parce qu’elle sait siffler avec ses orteils."},{"a":"Improve your goldfish's physical fitness by getting him a bicycle.","b":"Améliorez la forme physique de votre poisson rouge en lui offrant un vélo."},{"a":"There were a lot of paintings of monkeys waving bamboo sticks in the gallery.","b":"Il y avait beaucoup de peintures de singes agitant des bâtons de bambou dans la galerie."},{"a":"Yeah, I think it's a good environment for learning English.","b":"Oui, je pense que c'est un bon environnement pour apprendre l'anglais."},{"a":"He always wore his sunglasses at night.","b":"La nuit, il portait toujours ses lunettes de soleil."},{"a":"So long and thanks for the fish.","b":"Au revoir et merci pour le poisson."},{"a":"He stepped gingerly onto the bridge knowing that enchantment awaited on the other side.","b":"Il marcha avec précaution sur le pont, sachant que l'enchantement l'attendait de l'autre côté."},{"a":"The quick brown fox jumps over the lazy dog.","b":"Le renard brun rapide saute par-dessus le chien paresseux."},{"a":"He set out for a short walk, but now all he could see were mangroves and water were for miles.","b":"Il partit pour une courte promenade, mais maintenant tout ce qu'il pouvait voir c'était des mangroves et de l'eau à des kilomètres à la ronde."},{"a":"Normal activities took extraordinary amounts of concentration at the high altitude.","b":"Les activités normales demandaient une concentration extraordinaire à haute altitude."},{"a":"Jason lived his life by the motto : Anything worth doing is worth doing poorly.","b":"Jason a vécu sa vie selon la devise : tout ce qui vaut la peine d'être fait vaut la peine d'être mal fait."},{"a":"When nobody is around, the trees gossip about the people who have walked under them.","b":"Quand il n'y a personne autour, les arbres racontent des ragots sur les gens qui ont marché sous eux."},{"a":"Watching the geriatric men’s softball team brought back memories of 3 yr olds playing t-ball.","b":"Regarder l’équipe de softball masculine gériatrique m’a rappelé des souvenirs d’enfants de 3 ans jouant au t-ball."},{"a":"He would only survive if he kept the fire going and he could hear thunder in the distance.","b":"Il ne survivrait que s'il entretenait le feu et s'il pouvait entendre le tonnerre au loin."},{"a":"The sight of his goatee made me want to run and hide under my sister-in-law's bed.","b":"La vue de sa barbiche m'a donné envie de courir me cacher sous le lit de ma belle-sœur."},{"a":"There was no telling what thoughts would come from the machine.","b":"On ne pouvait pas savoir quelles pensées allaient sortir de la machine."},{"a":"I'd rather be a bird than a fish.","b":"Je préférerais être un oiseau qu'un poisson."},{"a":"Nobody questions who built the pyramids in Mexico.","b":"Personne ne se demande qui a construit les pyramides au Mexique."},{"a":"There's a message for you if you look up.","b":"Il y a un message pour vous si vous levez les yeux."},{"a":"It was difficult for Mary to admit that most of her workout consisted of exercising poor judgment","b":"Il était difficile pour Mary d’admettre que la majeure partie de son entraînement consistait à faire preuve d’un mauvais jugement."},{"a":"Waffles are always better without fire ants and fleas.","b":"Les gaufres sont toujours meilleures sans fourmis de feu ni puces."},{"a":"25 years later, she still regretted that specific moment.","b":"25 ans plus tard, elle regrette encore ce moment précis."},{"a":"Martha came to the conclusion that shake weights are a great gift for any occasion.","b":"Martha est arrivée à la conclusion que les poids shake sont un excellent cadeau pour toute occasion."},{"a":"You bite up because of your lower jaw.","b":"Vous mordez à cause de votre mâchoire inférieure."},{"a":"He was sure the Devil created red sparkly glitter.","b":"Il était sûr que le Diable avait créé des paillettes rouges étincelantes."},{"a":"It took me too long to realize that the ceiling hadn't been painted to look like the sky.","b":"Il m’a fallu trop de temps pour réaliser que le plafond n’avait pas été peint pour ressembler au ciel."},{"a":"Sometimes it is better to just walk away from things and go back to them later when you’re in a better frame of mind.","b":"Parfois, il est préférable de simplement s’éloigner des choses et d’y revenir plus tard, lorsque vous êtes dans un meilleur état d’esprit."},{"a":"I used to live in my neighbor's fishpond, but the aesthetic wasn't to my taste.","b":"J'habitais dans l'étang à poissons de mon voisin, mais l'esthétique n'était pas à mon goût."},{"a":"The body piercing didn't go exactly as he expected.","b":"Le piercing ne s'est pas déroulé exactement comme il l'avait prévu."},{"a":"Sometimes you have to just give up and win by cheating.","b":"Parfois, il faut simplement abandonner et gagner en trichant."},{"a":"Bill ran from the giraffe toward the dolphin.","b":"Bill a couru de la girafe vers le dauphin."},{"a":"Tuesdays are free if you bring a gnome costume.","b":"Les mardis sont gratuits si vous apportez un costume de gnome."},{"a":"The secret code they created made no sense, even to them.","b":"Le code secret qu’ils avaient créé n’avait aucun sens, même pour eux."},{"a":"On a scale from one to ten, what's your favorite flavor of random grammar?","b":"Sur une échelle de un à dix, quelle est votre saveur préférée de grammaire aléatoire ?"},{"a":"He was willing to find the depths of the rabbit hole in order to be with her.","b":"Il était prêt à trouver les profondeurs du terrier du lapin pour être avec elle."},{"a":"A glittering gem is not enough.","b":"Un joyau scintillant ne suffit pas."},{"a":"Stop waiting for exceptional things to just happen.","b":"Arrêtez d’attendre que des choses exceptionnelles se produisent."},{"a":"The father handed each child a roadmap at the beginning of the 2-day road trip and explained it was so they could find their way home.","b":"Au début du voyage de deux jours, le père a remis à chaque enfant une feuille de route et lui a expliqué que c'était pour qu'ils puissent retrouver le chemin du retour."},{"a":"I'm not a party animal, but I do like animal parties.","b":"Je ne suis pas un fêtard, mais j'aime les fêtes d'animaux."},{"a":"I would be delighted if the sea were full of cucumber juice.","b":"Je serais ravi si la mer était pleine de jus de concombre."},{"a":"He walked into the basement with the horror movie from the night before playing in his head.","b":"Il est entré dans le sous-sol avec le film d'horreur de la veille qui tournait dans sa tête."},{"a":"When confronted with a rotary dial phone the teenager was perplexed.","b":"Confronté à un téléphone à cadran rotatif, l'adolescent était perplexe."},{"a":"They're playing the piano while flying in the plane.","b":"Ils jouent du piano pendant le vol en avion."},{"a":"The tattered work gloves speak of the many hours of hard labor he endured throughout his life.","b":"Les gants de travail en lambeaux témoignent des nombreuses heures de dur labeur qu'il a endurées tout au long de sa vie."},{"a":"That would be the first time.","b":"Ce serait la première fois."}]